In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [11]:
number = np.where(df["FlightNumber"].isnull())

In [16]:
number = number[0]

In [19]:
df["FlightNumber"].iloc[number] = df["FlightNumber"][0] + number*10

/Users/santoshsaxena/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [20]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [28]:
x = []
y = []
for i in df["From_To"]:
    a,b = i.split("_")
    x.append(a)
    y.append(b)

In [48]:
temporary_df = pd.DataFrame({"From":x,"To":y})

In [49]:
temporary_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [52]:
for i in range(len(temporary_df)):
    temporary_df["From"][i] = temporary_df["From"][i][0].upper() + temporary_df["From"][i][1:].lower()
    temporary_df["To"][i] = temporary_df["To"][i][0].upper() + temporary_df["To"][i][1:].lower()

In [53]:
temporary_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [55]:
df.drop("From_To", inplace = True, axis = 1)

In [63]:
df = temporary_df.join(df)

In [64]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan       10055.0            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris       10075.0          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"

In [65]:
temp = df["RecentDelays"]

In [83]:
temp

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [77]:
temp

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [96]:
for i in range(len(df["RecentDelays"])):
    result = 3 - len(temp[i])
    for j in range(result):
        df["RecentDelays"][i].append("Nan")

In [105]:
x=[]
y=[]
z=[]
for i in range(len(df["RecentDelays"])):
    x.append(df["RecentDelays"][i][0])
    y.append(df["RecentDelays"][i][1])
    z.append(df["RecentDelays"][i][2])

In [109]:
df = pd.DataFrame({"Delay1":x, "Delay2":y, "Delay3":z}).join(df)

In [113]:
df.drop("delay1", axis = 1,inplace = True)

In [114]:
df

  Delay1 Delay2 Delay3      From         To  FlightNumber              Airline
0     23     47    Nan    London      Paris       10045.0               KLM(!)
1    Nan    Nan    Nan    Madrid      Milan       10055.0    <Air France> (12)
2     24     43     87    London  Stockholm       10065.0  (British Airways. )
3     13    Nan    Nan  Budapest      Paris       10075.0       12. Air France
4     67     32    Nan  Brussels     London       10085.0          "Swiss Air"

In [117]:
df[df == "Nan"] = np.nan

/Users/santoshsaxena/opt/anaconda3/lib/python3.8/site-packages/pandas/core/ops/array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

In [118]:
df

  Delay1 Delay2 Delay3      From         To  FlightNumber              Airline
0     23     47    NaN    London      Paris       10045.0               KLM(!)
1    NaN    NaN    NaN    Madrid      Milan       10055.0    <Air France> (12)
2     24     43     87    London  Stockholm       10065.0  (British Airways. )
3     13    NaN    NaN  Budapest      Paris       10075.0       12. Air France
4     67     32    NaN  Brussels     London       10085.0          "Swiss Air"

In [119]:
df.isnull()

   Delay1  Delay2  Delay3   From     To  FlightNumber  Airline
0   False   False    True  False  False         False    False
1    True    True    True  False  False         False    False
2   False   False   False  False  False         False    False
3   False    True    True  False  False         False    False
4   False   False    True  False  False         False    False